# Ans.-1

In [1]:
import pandas as pd

In [2]:
# five functions with their execution

In [3]:
# 1. Creating datframe

In [4]:
df = pd.DataFrame({'Name': ['Saurabh','Priyans','Deep'],
                  'Mobile_no.': [9434853258,9842415430,9258444627],
                  'Email_ID': ['abc@gmail.com','xyz@gmail.com','pqr@gmail.com']})

In [5]:
df

      Name  Mobile_no.       Email_ID
0  Saurabh  9434853258  abc@gmail.com
1  Priyans  9842415430  xyz@gmail.com
2     Deep  9258444627  pqr@gmail.com

In [6]:
# 2. Reading csv file

In [7]:
df1 = pd.read_csv('insurance.csv')

In [8]:
df1

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

In [9]:
# 3. For statistical analysis of dataframe

In [10]:
df1.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [11]:
# 4. To see no. of categories present in column

In [12]:
pd.Categorical(df1['region'])

['southwest', 'southeast', 'southeast', 'northwest', 'northwest', ..., 'northwest', 'northeast', 'southeast', 'southwest', 'northwest']
Length: 1338
Categories (4, object): ['northeast', 'northwest', 'southeast', 'southwest']

In [13]:
# 5. To get information of dataframe

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        3 non-null      object
 1   Mobile_no.  3 non-null      int64
 2   Email_ID    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

# Ans.-2

In [15]:
df2 = pd.DataFrame({ 'A': ['a1','a2','a3','a4','a5'],
                    'B': ['b1','b2','b3','b4','b5'],
                    'C': ['c1','c2','c3','c4','c5']})

In [16]:
df2

    A   B   C
0  a1  b1  c1
1  a2  b2  c2
2  a3  b3  c3
3  a4  b4  c4
4  a5  b5  c5

In [17]:
index = [2*i+1 for i in range(len(df2))]

In [18]:
df2['Index'] = index

In [19]:
df2.set_index('Index',inplace = True)

In [20]:
df2

        A   B   C
Index
1      a1  b1  c1
3      a2  b2  c2
5      a3  b3  c3
7      a4  b4  c4
9      a5  b5  c5

# Ans.-3

In [21]:
# Creating a dataframe of values

In [22]:
df3 = pd.DataFrame({'Values':[10,20,30,40,50]})

In [23]:
df3

   Values
0      10
1      20
2      30
3      40
4      50

In [24]:
# Taking out the sum of the first three values by making a python function that iterates over the values

In [25]:
def sum_of_first3(dataframe):
    s=0
    for i,j in dataframe.iterrows():
        if i<3: s=s+j
        else: break  
    return s[0]

In [26]:
sum_of_first3(df3[['Values']])

60

# Ans.-4

In [27]:
# Creating a dataframe containing text column with categorical data in it

In [28]:
df4 = pd.DataFrame({'Text':['Saurabh','Priyans','Deep','Om','Harsh','Vansh','Ridham','Satyam']})

In [29]:
df4

      Text
0  Saurabh
1  Priyans
2     Deep
3       Om
4    Harsh
5    Vansh
6   Ridham
7   Satyam

In [30]:
df4['Word_count'] = df4['Text'].apply(lambda x: len(x))

In [31]:
df4

      Text  Word_count
0  Saurabh           7
1  Priyans           7
2     Deep           4
3       Om           2
4    Harsh           5
5    Vansh           5
6   Ridham           6
7   Satyam           6

# Ans.-5

In [32]:
df4.size  #It will give total no. elements present in dataframe

16

In [33]:
df4.shape #It will give tuple (rows,column) which represent dimension of dataframe

(8, 2)

# Ans.-6

To read excel sheet we use: pd.read_excel('FILE_NAME')

# Ans.-7

In [34]:
df5 = pd.DataFrame({'Email': ['saurabh@domain.com','satyam@domain.com',
                              'sneh@domain.com','harsh@domain.com',
                              'vansh@domain.com','ridham@domain.com']})

In [35]:
df5

                Email
0  saurabh@domain.com
1   satyam@domain.com
2     sneh@domain.com
3    harsh@domain.com
4    vansh@domain.com
5   ridham@domain.com

In [36]:
df5['Username'] = df5['Email'].apply(lambda x: x.split(sep = '@')[0])

In [37]:
df5

                Email Username
0  saurabh@domain.com  saurabh
1   satyam@domain.com   satyam
2     sneh@domain.com     sneh
3    harsh@domain.com    harsh
4    vansh@domain.com    vansh
5   ridham@domain.com   ridham

# Ans.-8

In [38]:
df6 = pd.DataFrame({'A' : [3,8,6,2,9],
                    'B' : [5,2,9,3,1],
                    'C' : [1,7,4,5,2]
                  })

In [39]:
df6

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [40]:
df6_new = df6[(df6['A'] > 5) & (df6['B'] < 10)]

In [41]:
df6_new

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Ans.-9

In [42]:
df3 # Dataframe containing values as column

   Values
0      10
1      20
2      30
3      40
4      50

In [43]:
# calculating mean

In [44]:
df3.mean()

Values    30.0
dtype: float64

In [45]:
# calculating median

In [46]:
df3.median()

Values    30.0
dtype: float64

In [47]:
# calculating standard deviation

In [48]:
df3.std()

Values    15.811388
dtype: float64

# Ans.-10

In [49]:
date = pd.date_range(start = '2023-01-01',periods = 7)

In [50]:
date

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07'],
              dtype='datetime64[ns]', freq='D')

In [51]:
df7 = pd.DataFrame({ 'Sales' : [100,120,130,150,190,100,90],'date':date})

In [52]:
df7

   Sales       date
0    100 2023-01-01
1    120 2023-01-02
2    130 2023-01-03
3    150 2023-01-04
4    190 2023-01-05
5    100 2023-01-06
6     90 2023-01-07

In [53]:
df7['Moving_Average'] = df7['Sales'].rolling(window = 7,min_periods = 1).mean()

In [54]:
df7

   Sales       date  Moving_Average
0    100 2023-01-01      100.000000
1    120 2023-01-02      110.000000
2    130 2023-01-03      116.666667
3    150 2023-01-04      125.000000
4    190 2023-01-05      138.000000
5    100 2023-01-06      131.666667
6     90 2023-01-07      125.714286

In [55]:
df7

   Sales       date  Moving_Average
0    100 2023-01-01      100.000000
1    120 2023-01-02      110.000000
2    130 2023-01-03      116.666667
3    150 2023-01-04      125.000000
4    190 2023-01-05      138.000000
5    100 2023-01-06      131.666667
6     90 2023-01-07      125.714286

# Ans.-11

In [56]:
date = pd.date_range(start = '2023-01-01',end = '2023-01-05')

In [57]:
df_date = pd.DataFrame({'Date' : date})

In [58]:
df_date

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [59]:
date.day_name()

Index(['Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday'], dtype='object')

In [60]:
df_date['Weekday'] = pd.DataFrame(date.day_name())

In [61]:
df_date

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# Ans.-12

In [62]:
df8 = pd.DataFrame({'Date' : ['2022-12-12 22:12:30', '2023-01-01 00:01:00', '2023-01-15 12:12:12',
                             '2020-10-25 05:14:01', '2023-02-05 09:01:00', '2023-03-03 01:01:01',
                             '2023-01-26 12:10:12', '2023-01-31 12:00:00', '2023-06-15 18:12:00',
                             '2020-01-12 12:00:12', '2023-02-15 05:05:16', '2023-01-20 20:20:20']})

In [63]:
df8['Date'] = pd.to_datetime(df8['Date'])

In [64]:
df8

                  Date
0  2022-12-12 22:12:30
1  2023-01-01 00:01:00
2  2023-01-15 12:12:12
3  2020-10-25 05:14:01
4  2023-02-05 09:01:00
5  2023-03-03 01:01:01
6  2023-01-26 12:10:12
7  2023-01-31 12:00:00
8  2023-06-15 18:12:00
9  2020-01-12 12:00:12
10 2023-02-15 05:05:16
11 2023-01-20 20:20:20

In [65]:
def select_date(df, start_date, end_date):
    start_date = pd.to_datetime(start_date)
    end_date = pd.to_datetime(end_date)
    date = df[(df['Date']>= start_date) & (df['Date'] <= end_date)]
    return date

In [66]:
date_in_range = select_date(df8,'2023-01-01','2023-01-31')

In [67]:
print(date_in_range)

                  Date
1  2023-01-01 00:01:00
2  2023-01-15 12:12:12
6  2023-01-26 12:10:12
11 2023-01-20 20:20:20

# Ans.-13

To use the basic functions of pandas, we will import pandas library giving alias as pd.